---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips.TopBendLength
source: html/e28813b9-a7f7-c4a4-214f-161f6b37466e.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips.TopBendLength Property

Top Bend segment length.

## Syntax (C#)
```csharp
public double TopBendLength { get; set; }
```